# PointCloud Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceTypes..::..BuiltInExternalResourceTypes..::..PointCloud Property
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class See Also
---
An external resource type representing Point Clouds. This type is reserved for future expansion but not yet implemented.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalResourceType PointCloud { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointCloud As ExternalResourceType
	Get
```

Visual C++
---
```text
public:
static property ExternalResourceType^ PointCloud {
	ExternalResourceType^ get ();
}
```

# See Also
ExternalResourceTypes..::..BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace